[
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "Balance Sheet",
        "model_driven": true,
        "model_estimates_line_items": [
            "Projected balance sheet asset balances (e.g., loans outstanding by category) under scenario conditions",
            "Projected liability balances (e.g., total deposits) under scenario conditions"
        ],
        "rationale": "FR Y-14A Summary Schedule – Balance Sheet Projections – This metric group contains projected balance sheet items (assets, loans, deposits, etc.) under stress scenarios. Banks typically use forecasting models to project balance sheet volumes in each scenario. These projections are model-driven (e.g. loan and deposit growth models incorporating macro variables)."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "Income Statement and PPNR",
        "model_driven": true,
        "model_estimates_line_items": [
            "Net interest income (projected) – interest revenue minus interest expense, modeled under scenario assumptions",
            "Noninterest income (projected) – e.g. fees, trading and other income, modeled under scenario assumptions",
            "Noninterest expense (projected) – operational and other expenses, modeled under scenario assumptions",
            "Pre-Provision Net Revenue (PPNR) – projected revenue net of expense before losses, calculated from modeled income and expense components"
        ],
        "rationale": "FR Y-14A Summary Schedule – Income Statement (Revenue/Expense) and PPNR – The income statement projections, including Pre-Provision Net Revenue (PPNR), are driven by quantitative models. Banks use PPNR models to forecast net interest income, fee income, trading revenue, and non-interest expense under each scenario. Key modeled line items include net interest income, noninterest income, noninterest expense, and resulting PPNR."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "Capital Ratios and RWA",
        "model_driven": true,
        "model_estimates_line_items": [
            "Projected risk-weighted assets (RWA) under each scenario – estimated using internal risk models for credit and counterparty exposures",
            "Common Equity Tier 1 (CET1) capital ratio (projected) – calculated based on modeled losses, earnings, and RWA projections",
            "Tier 1 & Total Capital ratios (projected) – calculated from modeled capital and RWA outcomes under scenario conditions"
        ],
        "rationale": "FR Y-14A Summary Schedule – Capital (Regulatory Capital Projections) – Includes projected regulatory capital amounts and ratios over the planning horizon. These values are indirectly driven by models since key components like projected RWA are generated by banks’ models. Capital ratios are derived from modeled earnings and RWA projections."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "Retail Loan Loss Projections",
        "model_driven": true,
        "model_estimates_line_items": [
            "Projected net charge-offs on residential mortgages (first lien and home equity) – based on scenario-driven credit loss models",
            "Projected credit card loan losses – estimated using portfolio loss models under stress scenarios",
            "Projected auto and other consumer loan losses – derived from quantitative credit risk models given scenario macro factors"
        ],
        "rationale": "FR Y-14A Retail Credit Losses – This metric group covers projected credit losses for retail loan portfolios. Loss projections are model-driven using quantitative credit risk models (like PD/LGD models and macroeconomic regressions) to forecast losses under stress."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "Wholesale Loan Loss Projections",
        "model_driven": true,
        "model_estimates_line_items": [
            "Projected losses on corporate loans and CRE loans – derived from internal credit models (PD/LGD-based) under scenario conditions",
            "Modeled loss rates for wholesale portfolios (e.g., commercial & industrial, commercial real estate) given macroeconomic stress variables"
        ],
        "rationale": "FR Y-14A Wholesale Credit Losses – Projected losses on wholesale portfolios are driven by quantitative models. Internal credit models (PD/LGD) project losses under stress for corporate exposures."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "AFS/HTM Securities Losses",
        "model_driven": true,
        "model_estimates_line_items": [
            "Projected OTTI losses on Available-for-Sale securities – modeled declines in fair value under stress",
            "Projected credit loss provisions for HTM securities – estimated via credit models for bond portfolios",
            "Projected Other Comprehensive Income (OCI) impact on AFS/HTM – from scenario-driven fair value changes"
        ],
        "rationale": "FR Y-14A AFS/HTM Securities – This group captures modeled loss estimates on Available-for-Sale and Held-to-Maturity securities. Banks project OTTI and credit loss provisions using valuation models under stress scenarios."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "Trading Shock Losses",
        "model_driven": true,
        "model_estimates_line_items": [
            "Global Market Shock trading loss estimate – revaluation loss on trading portfolio under Fed's market shock scenario, computed using pricing models",
            "Stressed fair value changes on trading assets (e.g., derivatives, bonds, equities) – generated by the bank’s market risk models"
        ],
        "rationale": "FR Y-14A Trading – The trading shock metric group is model-driven. Under the Global Market Shock scenario, firms re-value their trading positions using pricing models."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Summary",
        "metric_group": "Counterparty Credit Risk",
        "model_driven": true,
        "model_estimates_line_items": [
            "Largest counterparty default loss estimate – modeled loss assuming the default of the largest counterparty under stress",
            "Stressed CVA (Credit Valuation Adjustment) losses – estimated increase in CVA reserves under the market shock scenario, from internal counterparty exposure models"
        ],
        "rationale": "FR Y-14A Counterparty Credit Risk (Schedule A.5) – Captures modeled losses from counterparty default scenarios and valuation adjustments. Values reported are outputs of credit risk models and simulations."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Operational Risk",
        "metric_group": "Operational Risk Losses",
        "model_driven": true,
        "model_estimates_line_items": [
            "Projected operational risk losses (aggregate) – estimated using scenario analysis or statistical models for operational risk",
            "Modeled loss amounts by operational risk event type (e.g., fraud, conduct, cyber) under the stress scenario"
        ],
        "rationale": "FR Y-14A Operational Risk Schedule – Contains projected operational loss amounts under stress scenarios, typically derived from qualitative scenario analysis models or statistical loss distribution models."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Regulatory Capital Transitions",
        "metric_group": "Capital Rule Transitions",
        "model_driven": false,
        "model_estimates_line_items": [],
        "rationale": "FR Y-14A Regulatory Capital Transitions – Includes changes in capital due to regulatory phase-ins or rules. These values are computed using formulas and accounting rules, not predictive models. We mark this as not model-driven."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Regulatory Capital Instruments",
        "metric_group": "Capital Actions and Instruments",
        "model_driven": false,
        "model_estimates_line_items": [],
        "rationale": "FR Y-14A Regulatory Capital Instruments – Reports detailed information on capital instruments and planned capital actions. These figures are not model outputs; they are compiled from management plans. Model-driven is false."
    },
    {
        "report": "FR Y-14A",
        "schedule": "Business Plan Changes",
        "metric_group": "Material Business Changes Impact",
        "model_driven": false,
        "model_estimates_line_items": [],
        "rationale": "FR Y-14A Business Plan Changes – Allows firms to illustrate the effect of material business plan changes. These adjustments are management inputs, not model outputs. Model-driven is false."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "A – Retail Risk",
        "metric_group": "U.S. Auto Loans",
        "model_driven": true,
        "model_estimates_line_items": [
            "Probability of Default (PD) – average PD for auto loans, from internal credit models",
            "Loss Given Default (LGD) – loss severity percentage from credit models",
            "Risk-Weighted Asset (RWA) (Auto segment) – aggregate RWA calculated using PD/LGD"
        ],
        "rationale": "FR Y-14Q Retail Risk (Schedule A) – Auto loan segment includes model-derived PD, LGD, and RWA. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "A – Retail Risk",
        "metric_group": "U.S. Small Business Loans",
        "model_driven": true,
        "model_estimates_line_items": [
            "Probability of Default (PD) – modeled PD for small business loans",
            "Loss Given Default (LGD) – modeled LGD for small business loans",
            "Risk-Weighted Asset (RWA) – calculated from PD/LGD"
        ],
        "rationale": "FR Y-14Q Retail Risk – Small business loan segment includes model-derived PD, LGD, and RWA. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "A – Retail Risk",
        "metric_group": "U.S. Other Consumer Loans",
        "model_driven": true,
        "model_estimates_line_items": [
            "Probability of Default (PD) – model-derived average PD for other consumer loans",
            "Loss Given Default (LGD) – model-derived LGD for other consumer loans",
            "Risk-Weighted Asset (RWA) – aggregate RWA from internal model outputs"
        ],
        "rationale": "FR Y-14Q Retail Risk – Other consumer loans segment includes modeled PD, LGD, and RWA. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "A – Retail Risk",
        "metric_group": "International Auto Loans",
        "model_driven": true,
        "model_estimates_line_items": [
            "Probability of Default (PD) – modeled PD for international auto loans",
            "Loss Given Default (LGD) – modeled LGD for international auto loans",
            "Risk-Weighted Asset (RWA) – RWA from PD/LGD models"
        ],
        "rationale": "FR Y-14Q Retail Risk – International auto loans segment includes modeled PD, LGD, and RWA. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "A – Retail Risk",
        "metric_group": "International Credit Card Loans",
        "model_driven": true,
        "model_estimates_line_items": [
            "Probability of Default (PD) – model-estimated PD for international credit card accounts",
            "Loss Given Default (LGD) – model-estimated LGD for the international credit card portfolio",
            "Risk-Weighted Asset (RWA) – RWA for international credit card loans, computed via the IRB formula using model inputs (PD, LGD)"
        ],
        "rationale": "FR Y-14Q Retail Risk – International credit card segment includes modeled PD, LGD, and RWA. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "A – Retail Risk",
        "metric_group": "International Home Equity Loans",
        "model_driven": true,
        "model_estimates_line_items": [
            "Probability of Default (PD) – internal model output for PD on international home equity loan segment",
            "Loss Given Default (LGD) – internal model output for LGD on international home equity loans",
            "Risk-Weighted Asset (RWA) – aggregate RWA for international home equity segment, from model-driven PD/LGD per capital rules"
        ],
        "rationale": "FR Y-14Q Retail Risk – International home equity segment includes modeled PD, LGD, and RWA. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "A – Retail Risk",
        "metric_group": "International First Lien Mortgages",
        "model_driven": true,
        "model_estimates_line_items": [
            "Probability of Default (PD) – modeled PD for international residential mortgage loans (first liens)",
            "Loss Given Default (LGD) – modeled LGD for international mortgage portfolio",
            "Risk-Weighted Asset (RWA) – RWA for international mortgages, computed from model outputs under the advanced capital framework"
        ],
        "rationale": "FR Y-14Q Retail Risk – International first lien mortgages include modeled PD, LGD, and RWA. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "H – Wholesale Risk",
        "metric_group": "Wholesale (Corporate & CRE)",
        "model_driven": true,
        "model_estimates_line_items": [
            "Internal Probability of Default (PD) for each wholesale borrower – derived from the bank’s internal rating model",
            "Loss Given Default (LGD) for corporate/CRE exposures – estimated via the bank’s credit risk models",
            "Risk-Weighted Assets (RWA) for wholesale exposures – calculated per Basel rules using the model-generated PD and LGD for each loan"
        ],
        "rationale": "FR Y-14Q Wholesale Risk – Captures internal model PD, LGD, and RWA for corporate and CRE exposures. Model-driven is true."
    },
    {
        "report": "FR Y-14Q",
        "schedule": "F – Trading",
        "metric_group": "Trading and Market Risk",
        "model_driven": true,
        "model_estimates_line_items": [
            "Stressed trading portfolio loss (Global Market Shock) – model-calculated loss on trading positions under the hypothetical shock scenario",
            "Risk sensitivities (e.g., DV01 for interest rates, credit spread sensitivities) – quantitative measures computed from pricing models for the trading book",
            "Value-at-Risk (VaR) and other market risk metrics – derived from the bank’s internal statistical risk models"
        ],
        "rationale": "FR Y-14Q Trading Risk – Stress P&L and risk sensitivities are computed from pricing and statistical models. Model-driven is true."
    },
    {
        "report": "FR Y-14M",
        "schedule": "A.1 – First Lien Mortgage",
        "metric_group": "First Lien Residential Loans",
        "model_driven": false,
        "model_estimates_line_items": [],
        "rationale": "FR Y-14M First Lien Mortgage Portfolio – Provides loan-level data for domestic first-lien mortgages. These are actual attributes and performance metrics, not produced by stress test models. Model-driven is false."
    },
    {
        "report": "FR Y-14M",
        "schedule": "B.1 – Home Equity",
        "metric_group": "Home Equity Loans/Lines",
        "model_driven": false,
        "model_estimates_line_items": [],
        "rationale": "FR Y-14M Home Equity Loan/Line Portfolio – Loan-level data are actual balances and performance metrics, not scenario or model outputs. Model-driven is false."
    },
    {
        "report": "FR Y-14M",
        "schedule": "D – Domestic Credit Card",
        "metric_group": "Credit Card Accounts",
        "model_driven": false,
        "model_estimates_line_items": [],
        "rationale": "FR Y-14M Credit Card Portfolio – Account-level and portfolio-level actual data (balances, delinquency, charge-offs). Not model-driven. Model-driven is false."
    },
    {
        "report": "FR Y-14M",
        "schedule": "C – Address Matching",
        "metric_group": "Mortgage Address Match",
        "model_driven": false,
        "model_estimates_line_items": [],
        "rationale": "FR Y-14M Address Matching – Schedule links first-lien and junior-lien mortgage records. Contains identifiers and mapping info only. No modeling involved. Model-driven is false."
    }
]